 # Tap repositories for additional Homebrew packages
 tap "aws/tap"  # AWS Homebrew tap
 tap "homebrew/bundle"  # Homebrew Bundle tap
 tap "homebrew/services"  # Homebrew Services tap
 tap 'homebrew/cask-fonts'
 tap 'homebrew/cask-versions'
 
 # Install Homebrew packages
 brew "act"  # Run GitHub Actions locally
 brew "aws-sam-cli"  # AWS Serverless Application Model CLI
 brew "awscli"  # AWS Command Line Interface
 brew "bash"  # Latest Bash version
 brew "coreutils"  # Those that come with macOS are outdated
 brew "curl"  # Command-line tool for transferring data with URL syntax
 brew "ffmpeg"  # Multimedia framework
 brew "gh"  # GitHub CLI
 brew "git"  # Distributed version control system
 brew "grep"  # Search text for patterns
 brew "mas"  # Mac App Store manager
 brew "mackup"  # Backup and restore application settings
 brew "node"  # JavaScript runtime
 brew "nvm" 
 brew "openssl@1.1"  # Cryptography and SSL/TLS toolkit
 brew "python"  # Latest Python 3.11 version
 brew "sqlite"  # C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine
 brew "tmux"  # Terminal multiplexer
 brew "webp"  # Image format that provides lossless and lossy compression
 
 # Install Homebrew Casks
 cask "bitwarden"  # Password manager
 cask "caffeine"  # Prevents your Mac from going to sleep
 cask "docker"  # Platform for building, sharing, and running applications
 cask "firefox"  # Web browser
 cask "github"  # GitHub Desktop
 cask "google-chrome"  # Web browser
 cask "iterm2"  # terminal
 cask "vivaldi" # Vivaldi Browser
 cask "pastebot"  # Clipboard manager
 cask "the-unarchiver"  # File extraction utility
 cask "visual-studio-code" # Code editor
 cask "cursor" # Code editor
 cask "zoom"  # Video conferencing
 
 # Install Visual Studio Code extensions
 vscode "GitHub.copilot"  # GitHub Copilot
 vscode "GitHub.copilot-chat"  # GitHub Copilot Chat
 vscode "GitHub.copilot-labs"  # GitHub Copilot Labs
 vscode "GitHub.vscode-github-actions"  # GitHub Actions
 vscode "VisualStudioExptTeam.intellicode-api-usage-examples"  # IntelliCode API Usage Examples
 vscode "VisualStudioExptTeam.vscodeintellicode"  # Visual Studio IntelliCode
 vscode "alefragnani.Bookmarks"  # Bookmarks
 vscode "bradlc.vscode-tailwindcss"  # Tailwind CSS IntelliSense
 vscode "christian-kohler.npm-intellisense"  # Npm Intellisense
 vscode "dbaeumer.vscode-eslint"  # ESLint
 vscode "eamodio.gitlens"  # GitLens
 vscode "eriklynd.json-tools"  # JSON Tools
 vscode "esbenp.prettier-vscode"  # Prettier - Code formatter
 vscode "ms-azuretools.vscode-docker"  # Docker
 vscode "ms-python.python"  # Python
 vscode "ms-vsliveshare.vsliveshare"  # Live Share
 vscode "rangav.vscode-thunder-client"  # Thunder Client
 vscode "redhat.vscode-yaml"  # YAML
